"""
скрипт для ввода данных в камасутру
fmyfile - имя файла графика месяца
на выходе генерируется файл с именем "2"
его потом открыть FARом, и можно будет для каждого человерка построчно
копировать данные в камасутру
при вставке в камасутру в ней должен быть выделен блок, куда вставлять
"""


km = {
      'В!8':'В',
      'В!6':'В',
      'В!11':'В',
      'В!15':'В',
      'ОТ!6':'МП',
      '0!3':'МП',
      '0!11':'МП',
      '!6':'МП',
      '!9':'МП',
      '!12':'ФВ',
      '!15':'МП',
      '2!3':'2',
      '2!4':'2',
      '2!5':'2',
      '3!4':'3',
      '3!5':'3',
      #'3!6':'ОТ01',
      '4!1':'4,5Н',
      '4!4':'4',
      '4!5':'4',
      '4!6':'4,5Н',
      '4!11':'4,5Н',
      '4!15':'4,5Н',
      '4!16':'4',
      '5!4':'5',
      '6!3':'6',
      '6!4':'6',
      '6!5':'6',      
      '6!11':'6',
      '7!4':'7',
      '7!5':'7',
      '8!2':'7,5H',
      '8!3':'8',
      '8!4':'8',
      '8!5':'8',
      #'8!6':'ОТ01' ,
      '8!6':'7,5H',
      '8!7':'8',
      '8!11':'7,5Н',
      '8!14':'8',
      '8!15':'7,5H',
      '8!16':'8',
      '9!3':'9',
      '10!3':'10',
      '10!5':'10',
      '11!3':'11ДВ',
      '11!5':'11ДВ',
      '11!6':'11ДВ',
      '11!16':'11ДВ',
      '12!3':'12',
      '12!5':'12',
      '12!6':'12',
      #'12!10':'*',
      '12!11':'12',
      '12!15':'12',
      '12!16':'12',
    }


#грузим
fmyfile = 'fmyfile'
#r'e:\projects\pyprj\k\июнь 2023 рабочий.gr'
with open(fmyfile, encoding='utf=8') as fi:
    mydata = fi.readlines()

#валим лишнее
while True:
    #print(mydata[0])
    if mydata[0][0] != '#':
        del (mydata[0])
    else:
        del (mydata[0])
        break

#разделяем людей и работу

d = {}    

for s in mydata:
    n, *w = s.strip().split('=')
    w = w[0].split('|')
    d[n] = w

for s in sorted(d.keys()):
    #print(s)
    #print(*d[s])
    for i in range(len(d[s])):
        s1 = d[s][i]
        if s1 == '': continue
        q = km.get(s1,'***')
        if q == '***':
            print('error in day', i)
            print('unexpected value:', d[s][i])
        d[s][i] = q
    print(*d[s], sep = '\t')

with open('fkfile', 'w', encoding='utf=8') as fi:
    for s in d.keys():
        fi.write(s + '\n')
        fi.write('\t'.join(d[s])+'\n')

